JerrickRowe/stm32-bootloader/projects/STM32F407-OWL/source/main.c
//    /* Mount SD card */
//    res = f_mount(&SDFatFs, (TCHAR const*)SDPath, 1);
//    if(res != FR_OK)
//    {
//        /* f_mount failed */
//        PRINT_INF("SD card cannot be mounted.");
//        sprintf(msg, "FatFs error code: %u", res);
//        PRINT_INF("%s",msg);
//        return;
//    }
//    PRINT_INF("SD mounted.");

//    /* Open file for programming */
//    res = f_open(&SDFile, CONF_FILENAME, FA_READ);
//    if(res != FR_OK)
//    {
//        /* f_open failed */
//        PRINT_INF("File cannot be opened.");
//        sprintf(msg, "FatFs error code: %u", res);
//        PRINT_INF("%s",msg);

//        SD_Eject();
//        PRINT_INF("SD ejected.");
//        return;
//    }
//    PRINT_INF("Software found on SD.");

//    /* Check size of application found on SD card */
//    if(Bootloader_CheckSize(f_size(&SDFile)) != BL_OK)
//    {
//        PRINT_INF("Error: app on SD card is too large.");

//        f_close(&SDFile);
//        SD_Eject();
//        PRINT_INF("SD ejected.");
//        return;
//    }
//    PRINT_INF("App size OK.");

//    /* Step 1: Init Bootloader and Flash */
//    Bootloader_Init();

//    /* Step 2: Erase Flash */
//    PRINT_INF("Erasing flash...");
//    LED_Y_ON();
//    Bootloader_Erase();
//    LED_Y_OFF();
//    PRINT_INF("Flash erase finished.");

//    /* If BTN is pressed, then skip programming */
//    if(IS_BTN_PRESSED())
//    {
//        PRINT_INF("Programming skipped.");

//        f_close(&SDFile);
//        SD_Eject();
//        PRINT_INF("SD ejected.");
//        return;
//    }

//    /* Step 3: Programming */
//    PRINT_INF("Starting programming...");
//    LED_Y_ON();
//    cntr = 0;
//    Bootloader_FlashBegin();
//    do
//    {
//        data = 0xFFFFFFFFFFFFFFFF;
//        res   = f_read(&SDFile, &data, 8, &num);
//        if(num)
//        {
//            status = Bootloader_FlashNext(data);
//            if(status == BL_OK)
//            {
//                cntr++;
//            }
//            else
//            {
//                sprintf(msg, "Programming error at: %lu byte", (cntr * 8));
//				PRINT_INF("%s",msg);

//                f_close(&SDFile);
//                SD_Eject();
//                PRINT_INF("SD ejected.");

//                LED_G_OFF();
//                LED_Y_OFF();
//                return;
//            }
//        }
//        if(cntr % 256 == 0)
//        {
//            /* Toggle green LED during programming */
//            LED_G_TG();
//        }
//    } while((res == FR_OK) && (num > 0));

//    /* Step 4: Finalize Programming */
//    Bootloader_FlashEnd();
//    f_close(&SDFile);
//    LED_G_OFF();
//    LED_Y_OFF();
//    PRINT_INF("Programming finished.");
//    sprintf(msg, "Flashed: %lu bytes.", (cntr * 8));
//    PRINT_INF("%s",msg);

//    /* Open file for verification */
//    res = f_open(&SDFile, CONF_FILENAME, FA_READ);
//    if(res != FR_OK)
//    {
//        /* f_open failed */
//        PRINT_INF("File cannot be opened.");
//        sprintf(msg, "FatFs error code: %u", res);
//        PRINT_INF("%s",msg);

//        SD_Eject();
//        PRINT_INF("SD ejected.");
//        return;
//    }

//    /* Step 5: Verify Flash Content */
//    addr = APP_ADDRESS;
//    cntr = 0;
//    do
//    {
//        data = 0xFFFFFFFFFFFFFFFF;
//        res   = f_read(&SDFile, &data, 4, &num);
//        if(num)
//        {
//            if(*(uint32_t*)addr == (uint32_t)data)
//            {
//                addr += 4;
//                cntr++;
//            }
//            else
//            {
//                sprintf(msg, "Verification error at: %lu byte.", (cntr * 4));
//				PRINT_INF("%s",msg);

//                f_close(&SDFile);
//                SD_Eject();
//                PRINT_INF("SD ejected.");

//                LED_G_OFF();
//                return;
//            }
//        }
//        if(cntr % 256 == 0)
//        {
//            /* Toggle green LED during verification */
//            LED_G_TG();
//        }
//    } while((res == FR_OK) && (num > 0));
//    PRINT_INF("Verification passed.");
//    LED_G_OFF();

//    /* Eject SD card */
//    SD_Eject();
//    PRINT_INF("SD ejected.");

//    /* Enable flash write protection */
//#if(USE_WRITE_PROTECTION)
//    PRINT_INF("Enablig flash write protection and generating system reset...");
//    if(Bootloader_ConfigProtection(BL_PROTECTION_WRP) != BL_OK)
//    {
//        PRINT_INF("Failed to enable write protection.");
//        PRINT_INF("Exiting Bootloader.");
//    }
//#endif
}

/*** SD Card ******************************************************************/
uint8_t SD_Init(void)
{
//    SDCARD_ON();

//    if(FATFS_Init())
//    {
//        /* Error */
//        return 1;
//    }

//    if(BSP_SD_Init())
//    {
//        /* Error */
//        return 2;
//    }

    return 0;
}

void SD_DeInit(void)
{
//    BSP_SD_DeInit();
//    FATFS_DeInit();
//    SDCARD_OFF();
}

void SD_Eject(void)
{
    f_mount(NULL, (TCHAR const*)SDPath, 0);
}

/*** GPIO Configuration ***/
void GPIO_Startup(void)
{
    GPIO_InitTypeDef GPIO_InitStruct;

    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOC_CLK_ENABLE();

    /* Configure GPIO pin output levels */
    HAL_GPIO_WritePin(LED_G_Port, LED_G_Pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(LED_Y_Port, LED_Y_Pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(LED_R_Port, LED_R_Pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(SD_PWR_Port, SD_PWR_Pin, GPIO_PIN_SET);

    /* LED_G_Pin, LED_Y_Pin, LED_R_Pin */
    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull  = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;

    GPIO_InitStruct.Pin = LED_G_Pin;
    HAL_GPIO_Init(LED_G_Port, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = LED_Y_Pin;
    HAL_GPIO_Init(LED_Y_Port, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = LED_R_Pin;
    HAL_GPIO_Init(LED_R_Port, &GPIO_InitStruct);

    /* SD Card Power Pin */
    GPIO_InitStruct.Pin   = SD_PWR_Pin;
    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull  = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(SD_PWR_Port, &GPIO_InitStruct);

    /* User Button */
    GPIO_InitStruct.Pin   = BTN_Pin;
    GPIO_InitStruct.Mode  = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull  = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(BTN_Port, &GPIO_InitStruct);
}
void GPIO_DeInit(void)
{
    HAL_GPIO_DeInit(BTN_Port, BTN_Pin);
    HAL_GPIO_DeInit(LED_G_Port, LED_G_Pin);
    HAL_GPIO_DeInit(LED_Y_Port, LED_Y_Pin);
    HAL_GPIO_DeInit(LED_R_Port, LED_R_Pin);
    HAL_GPIO_DeInit(SD_PWR_Port, SD_PWR_Pin);

    __HAL_RCC_GPIOB_CLK_DISABLE();
    __HAL_RCC_GPIOC_CLK_DISABLE();
}


